---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.TooManyPickFaces
source: html/a64a00d5-acc4-0b27-cb5b-2c24f755cbfa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.TooManyPickFaces Property

Too many faces were created from imported meshes. Host by Face tools may not select the imported meshes correctly.
 Decrease the complexity of the file or try importing only selected layers to resolve.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooManyPickFaces { get; }
```